---
kind: method
id: M:Autodesk.Revit.DB.PointCloudInstance.GetScans
source: html/070a03d1-c33d-fc17-324e-60f727fcfb3c.htm
---
# Autodesk.Revit.DB.PointCloudInstance.GetScans Method

Returns array of scan names.

## Syntax (C#)
```csharp
public IList<string> GetScans()
```

## Returns
Resulting array of scan names.